fonecmid-diplom/src/Catalogs/ДоговорыКонтрагентов/ДоговорыКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ДоговорыКонтрагентов</name>
  <owners>Catalog.Контрагенты</owners>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДоговора</name>
    <type>
      <types>EnumRef.ВидыДоговоровКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_ПериодДействияНачало</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_СуммаАбонентскойПлаты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_СтоимостьЧасаРаботы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_ПериодДействияКонец</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

fonecmid-diplom/src/Enums/ВидыДоговоровКонтрагентов/ВидыДоговоровКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыДоговоровКонтрагентов</name>
  <enumValues>
    <name>Поставщик</name>
  </enumValues>
  <enumValues>
    <name>Покупатель</name>
  </enumValues>
  <enumValues>
    <name>ВКМ_АбонентскоеОбслуживание</name>
  </enumValues>
</mdclass:Enum>

fonecmid-diplom/src/Catalogs/ДоговорыКонтрагентов/Forms/ВКМ_ФормаЭлемента/Module.bsl
// {{lg 19/09/2025 Задание 1 по дипломной работе "Работа с заявками клиентов"
#Область ОбработчикиСобытийФормы 
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	
 Если Объект.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание Тогда
	
	ПериодДействияДоговораНачало = Элементы.Добавить("ПериодДействияДоговораНачало",Тип("ПолеФормы"),ЭтотОбъект);
	ПериодДействияДоговораНачало.ПутьКДанным = "Объект.ВКМ_ПериодДействияНачало";
	ПериодДействияДоговораНачало.Вид = ВидПоляФормы.ПолеВвода;
	ПериодДействияДоговораНачало.Заголовок = "Дата начала действия договора"; 
	
	ПериодДействияДоговораКонец = Элементы.Добавить("ПериодДействияДоговораКонец",Тип("ПолеФормы"),ЭтотОбъект);
	ПериодДействияДоговораКонец.ПутьКДанным = "Объект.ВКМ_ПериодДействияКонец";
	ПериодДействияДоговораКонец.Вид = ВидПоляФормы.ПолеВвода;
	ПериодДействияДоговораКонец.Заголовок = "Дата окончания действия договора"; 
	
	СуммаАбонентскойПлаты = Элементы.Добавить("СуммаАбонентскойПлаты",Тип("ПолеФормы"),ЭтотОбъект);
	СуммаАбонентскойПлаты.ПутьКДанным = "Объект.ВКМ_СуммаАбонентскойПлаты";
	СуммаАбонентскойПлаты.Вид = ВидПоляФормы.ПолеВвода;
	СуммаАбонентскойПлаты.Заголовок = "СуммаАбонентскойПлаты"; 	
	
	СтоимостьЧасаРаботы = Элементы.Добавить("СтоимостьЧасаРаботы",Тип("ПолеФормы"),ЭтотОбъект);
	СтоимостьЧасаРаботы.ПутьКДанным = "Объект.ВКМ_СтоимостьЧасаРаботы";
	СтоимостьЧасаРаботы.Вид = ВидПоляФормы.ПолеВвода;
	СтоимостьЧасаРаботы.Заголовок = "Стоимость часа работы";	
КонецЕсли;

КонецПроцедуры

#КонецОбласти
//}}lg
